# -*- coding: utf-8 -*-
'''
Задание 6.3

Скрипт должен обрабатывать записи в файле CAM_table.txt таким образом чтобы:
- считывались строки, в которых указаны MAC-адреса
- каждая строка, где есть MAC-адрес, должна обрабатываться таким образом,
  чтобы на стандартный поток вывода была выведена таблица вида:

 100    a1b2.ac10.7000     Gi0/1
 200    a0d4.cb20.7000     Gi0/2
 300    acb4.cd30.7000     Gi0/3
 100    a2bb.ec40.7000     Gi0/4
 500    aa4b.c550.7000     Gi0/5
 200    a1bb.1c60.7000     Gi0/6
 300    aa0b.cc70.7000     Gi0/7

'''
