# -*- coding: utf-8 -*-
"""
Задание 4.7

Преобразовать MAC-адрес в строке mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

mac = "AAAA:BBBB:CCCC"

# Вариант решения с помощью функции bin
bin_mac = bin(int(mac.replace(":", ""), 16))[2:]
print(bin_mac)

# Вариант решения с форматированием строк
bin_mac = "{:b}".format(int(mac.replace(":", ""), 16))
print(bin_mac)
