# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
ip, pr = input('Enter IP address in a format (10.1.1.0/24): ').split('/')
ip1, ip2, ip3, ip4 = ip.split('.')
prefix = int(pr)

ip_bin = f'{int(ip1):08b}{int(ip2):08b}{int(ip3):08b}{int(ip4):08b}'
net_bin = (ip_bin[0:prefix]) + ('0' * (32 - prefix))
net_ip1, net_ip2, net_ip3, net_ip4 = int(net_bin[0:8], 2), int(net_bin[8:16], 2), int(net_bin[16:24], 2), int(net_bin[24:32], 2)

mask = ('1' * prefix) + ((32 - prefix) * '0')
mask1, mask2, mask3, mask4 = int(mask[0:8], 2), int(mask[8:16], 2), int(mask[16:24], 2), int(mask[24:32], 2)


show = f"""
{net_ip1:<8}  {net_ip2:<8}  {net_ip3:<8}  {net_ip4:<8}
{net_ip1:08b}  {net_ip2:08b}  {net_ip3:08b}  {net_ip4:08b}

Mask:
/{prefix}
{mask1:<8}  {mask2:<8}  {mask3:<8}  {mask4:<8}
{mask1:08b}  {mask2:08b}  {mask3:08b}  {mask4:08b}
"""

print(show)

