# -*- coding: utf-8 -*-

'''
Задание 12.2

Создать функцию send_config_commands

Функция подключается по SSH (с помощью netmiko) к устройствам из списка, и выполняет перечень команд в конфигурационном режиме
на основании переданных аргументов.

Параметры функции:
* devices_list - список словарей с параметрами подключения к устройствам, которым надо передать команды
* config_commands - список команд, которые надо выполнить

Функция возвращает словарь с результатами выполнения команды:
* ключ - IP устройства
* значение - вывод с выполнением команд

Проверить работу функции на примере:
* устройств из файла devices.yaml (для этого надо считать информацию из файла)
* и списка команд commands

'''


import netmiko

commands = [ 'logging 10.255.255.1',
             'logging buffered 20010',
             'no logging console' ]

def send_config_commands(device_list, config_commands):
    """
    Функция подключается по SSH к устройствам из списка,
    и выполняет команды в конфигурационном режиме.

    Параметры функции:
        - devices_list - список словарей с параметрами подключения к устройствам, которым надо передать команды
        - config_commands - список команд, которые надо выполнить

    Функция возвращает словарь с результатами выполнения команды:
        - ключ - IP устройства
        - значение - вывод с выполнением команд
    """

